# [01]

In [1]:
import pandas as pd
import easygui

인원리스트 = [[i,i+1,i+2,i+3] for i in range(1,18,4)]

In [2]:
인원리스트

[[1, 2, 3, 4],
 [5, 6, 7, 8],
 [9, 10, 11, 12],
 [13, 14, 15, 16],
 [17, 18, 19, 20]]

In [3]:
시프레임 = pd.DataFrame(인원리스트, columns=['최', '박', '이', '김'],
                   index=['수원', '화성', '용인', '청주', '충주'])

In [4]:
시프레임

     최   박   이   김
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  16
충주  17  18  19  20

In [6]:
시프레임.sum().to_frame('city')

   city
최    45
박    50
이    55
김    60

In [8]:
시프레임.sum(axis=1).to_frame('총인원')

    총인원
수원   10
화성   26
용인   42
청주   58
충주   74

In [10]:
filename1 = easygui.fileopenbox()

In [11]:
filename1

'C:\\Users\\hana1602a\\Documents\\excel_python\\엑셀과코딩사이.xlsx'

In [12]:
workbook1 = pd.ExcelFile(filename1)
df0 = workbook1.parse(sheetname=0)

In [13]:
df0

    시   최   박   이   김
0  수원   1   2   3   4
1  화성   5   6   7   8
2  용인   9  10  11  12
3  청주  13  14  15  17
4  충주  18  19  20  21

In [15]:
df0 = df0.set_index('시')

In [16]:
df0

     최   박   이   김
시
수원   1   2   3   4
화성   5   6   7   8
용인   9  10  11  12
청주  13  14  15  17
충주  18  19  20  21